content/blog.org
#+hugo_base_dir: ../
#+hugo_section: pages



** DONE On the Practice of Multifactor Authentication
:PROPERTIES:
:EXPORT_FILE_NAME: practice-mfa
:EXPORT_HUGO_PUBLISHDATE: 2024-10-05
:END:
*** The basics
MFA is basically putting an extra step, an extra *barrier* to login into an app or website. This extra step is what creates security. It does not prevent attacks or stop attacks. But what it does do is simple: /it makes it harder for someone to hack you/.
*** The struggle
 Doing extra work is never fun. No one likes to do the extra work. I don't like doing extra work. So the struggle becomes, convincing people to do the extra work. It's a struggle to convince oneself.
*** The solution
Accept the fact that the risk is not acceptable. Convince others that the risk is not acceptable. Once you internalize this you become aware of the benefits of securing yourself with MFA.
